Tekla.Structures.Drawing.CannotGetAttributeForPluginException
The CannotGetAttributeForPluginException class defines the exception that is
thrown when Plugin.GetAttribute is called but the attribute cannot be fetched.

Tekla.Structures.Drawing.CannotGetAttributeForPluginException.#ctor
Creates a new CannotGetAttributeForPluginException instance.

Tekla.Structures.Drawing.CannotGetAttributeForPluginException.#ctor(System.String)
Creates a new CannotGetAttributeForPluginException instance.
Description: The additional description.

Tekla.Structures.Drawing.CannotGetAttributeForPluginException.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Initializes a new instance with serialized data.
info: The object that holds the serialized object data.
context: The contextual information about the source or destination.